GopalSaraf/Practicals/PSDL/include/proc/pic16f1778.inc
// Register: T2RST
#define T2RST T2RST
T2RST                                    equ 0498h
// bitfield definitions
T2RST_RSEL_POSN                          equ 0000h
T2RST_RSEL_POSITION                      equ 0000h
T2RST_RSEL_SIZE                          equ 0005h
T2RST_RSEL_LENGTH                        equ 0005h
T2RST_RSEL_MASK                          equ 001Fh
T2RST_RSEL0_POSN                         equ 0000h
T2RST_RSEL0_POSITION                     equ 0000h
T2RST_RSEL0_SIZE                         equ 0001h
T2RST_RSEL0_LENGTH                       equ 0001h
T2RST_RSEL0_MASK                         equ 0001h
T2RST_RSEL1_POSN                         equ 0001h
T2RST_RSEL1_POSITION                     equ 0001h
T2RST_RSEL1_SIZE                         equ 0001h
T2RST_RSEL1_LENGTH                       equ 0001h
T2RST_RSEL1_MASK                         equ 0002h
T2RST_RSEL2_POSN                         equ 0002h
T2RST_RSEL2_POSITION                     equ 0002h
T2RST_RSEL2_SIZE                         equ 0001h
T2RST_RSEL2_LENGTH                       equ 0001h
T2RST_RSEL2_MASK                         equ 0004h
T2RST_RSEL3_POSN                         equ 0003h
T2RST_RSEL3_POSITION                     equ 0003h
T2RST_RSEL3_SIZE                         equ 0001h
T2RST_RSEL3_LENGTH                       equ 0001h
T2RST_RSEL3_MASK                         equ 0008h
T2RST_RSEL4_POSN                         equ 0004h
T2RST_RSEL4_POSITION                     equ 0004h
T2RST_RSEL4_SIZE                         equ 0001h
T2RST_RSEL4_LENGTH                       equ 0001h
T2RST_RSEL4_MASK                         equ 0010h
T2RST_T2RSEL_POSN                        equ 0000h
T2RST_T2RSEL_POSITION                    equ 0000h
T2RST_T2RSEL_SIZE                        equ 0005h
T2RST_T2RSEL_LENGTH                      equ 0005h
T2RST_T2RSEL_MASK                        equ 001Fh
T2RST_T2RSEL0_POSN                       equ 0000h
T2RST_T2RSEL0_POSITION                   equ 0000h
T2RST_T2RSEL0_SIZE                       equ 0001h
T2RST_T2RSEL0_LENGTH                     equ 0001h
T2RST_T2RSEL0_MASK                       equ 0001h
T2RST_T2RSEL1_POSN                       equ 0001h
T2RST_T2RSEL1_POSITION                   equ 0001h
T2RST_T2RSEL1_SIZE                       equ 0001h
T2RST_T2RSEL1_LENGTH                     equ 0001h
T2RST_T2RSEL1_MASK                       equ 0002h
T2RST_T2RSEL2_POSN                       equ 0002h
T2RST_T2RSEL2_POSITION                   equ 0002h
T2RST_T2RSEL2_SIZE                       equ 0001h
T2RST_T2RSEL2_LENGTH                     equ 0001h
T2RST_T2RSEL2_MASK                       equ 0004h
T2RST_T2RSEL3_POSN                       equ 0003h
T2RST_T2RSEL3_POSITION                   equ 0003h
T2RST_T2RSEL3_SIZE                       equ 0001h
T2RST_T2RSEL3_LENGTH                     equ 0001h
T2RST_T2RSEL3_MASK                       equ 0008h
T2RST_T2RSEL4_POSN                       equ 0004h
T2RST_T2RSEL4_POSITION                   equ 0004h
T2RST_T2RSEL4_SIZE                       equ 0001h
T2RST_T2RSEL4_LENGTH                     equ 0001h
T2RST_T2RSEL4_MASK                       equ 0010h

// Register: T8TMR
#define T8TMR T8TMR
T8TMR                                    equ 049Ah
// bitfield definitions
T8TMR_TMR_POSN                           equ 0000h
T8TMR_TMR_POSITION                       equ 0000h
T8TMR_TMR_SIZE                           equ 0008h
T8TMR_TMR_LENGTH                         equ 0008h
T8TMR_TMR_MASK                           equ 00FFh
T8TMR_TMR8_POSN                          equ 0000h
T8TMR_TMR8_POSITION                      equ 0000h
T8TMR_TMR8_SIZE                          equ 0008h
T8TMR_TMR8_LENGTH                        equ 0008h
T8TMR_TMR8_MASK                          equ 00FFh

// Register: T8PR
#define T8PR T8PR
T8PR                                     equ 049Bh
// bitfield definitions
T8PR_PR_POSN                             equ 0000h
T8PR_PR_POSITION                         equ 0000h
T8PR_PR_SIZE                             equ 0008h
T8PR_PR_LENGTH                           equ 0008h
T8PR_PR_MASK                             equ 00FFh
T8PR_T8PR_POSN                           equ 0000h
T8PR_T8PR_POSITION                       equ 0000h
T8PR_T8PR_SIZE                           equ 0008h
T8PR_T8PR_LENGTH                         equ 0008h
T8PR_T8PR_MASK                           equ 00FFh

// Register: T8CON
#define T8CON T8CON
T8CON                                    equ 049Ch
// bitfield definitions
T8CON_OUTPS_POSN                         equ 0000h
T8CON_OUTPS_POSITION                     equ 0000h
T8CON_OUTPS_SIZE                         equ 0004h
T8CON_OUTPS_LENGTH                       equ 0004h
T8CON_OUTPS_MASK                         equ 000Fh
T8CON_CKPS_POSN                          equ 0004h
T8CON_CKPS_POSITION                      equ 0004h
T8CON_CKPS_SIZE                          equ 0003h
T8CON_CKPS_LENGTH                        equ 0003h
T8CON_CKPS_MASK                          equ 0070h
T8CON_ON_POSN                            equ 0007h
T8CON_ON_POSITION                        equ 0007h
T8CON_ON_SIZE                            equ 0001h
T8CON_ON_LENGTH                          equ 0001h
T8CON_ON_MASK                            equ 0080h
T8CON_OUTPS0_POSN                        equ 0000h
T8CON_OUTPS0_POSITION                    equ 0000h
T8CON_OUTPS0_SIZE                        equ 0001h
T8CON_OUTPS0_LENGTH                      equ 0001h
T8CON_OUTPS0_MASK                        equ 0001h
T8CON_OUTPS1_POSN                        equ 0001h
T8CON_OUTPS1_POSITION                    equ 0001h
T8CON_OUTPS1_SIZE                        equ 0001h
T8CON_OUTPS1_LENGTH                      equ 0001h
T8CON_OUTPS1_MASK                        equ 0002h
T8CON_OUTPS2_POSN                        equ 0002h
T8CON_OUTPS2_POSITION                    equ 0002h
T8CON_OUTPS2_SIZE                        equ 0001h
T8CON_OUTPS2_LENGTH                      equ 0001h
T8CON_OUTPS2_MASK                        equ 0004h
T8CON_OUTPS3_POSN                        equ 0003h
T8CON_OUTPS3_POSITION                    equ 0003h
T8CON_OUTPS3_SIZE                        equ 0001h
T8CON_OUTPS3_LENGTH                      equ 0001h
T8CON_OUTPS3_MASK                        equ 0008h
T8CON_CKPS0_POSN                         equ 0004h
T8CON_CKPS0_POSITION                     equ 0004h
T8CON_CKPS0_SIZE                         equ 0001h
T8CON_CKPS0_LENGTH                       equ 0001h
T8CON_CKPS0_MASK                         equ 0010h
T8CON_CKPS1_POSN                         equ 0005h
T8CON_CKPS1_POSITION                     equ 0005h
T8CON_CKPS1_SIZE                         equ 0001h
T8CON_CKPS1_LENGTH                       equ 0001h
T8CON_CKPS1_MASK                         equ 0020h
T8CON_CKPS2_POSN                         equ 0006h
T8CON_CKPS2_POSITION                     equ 0006h
T8CON_CKPS2_SIZE                         equ 0001h
T8CON_CKPS2_LENGTH                       equ 0001h
T8CON_CKPS2_MASK                         equ 0040h
T8CON_T8OUTPS_POSN                       equ 0000h
T8CON_T8OUTPS_POSITION                   equ 0000h
T8CON_T8OUTPS_SIZE                       equ 0004h
T8CON_T8OUTPS_LENGTH                     equ 0004h
T8CON_T8OUTPS_MASK                       equ 000Fh
T8CON_T8CKPS_POSN                        equ 0004h
T8CON_T8CKPS_POSITION                    equ 0004h
T8CON_T8CKPS_SIZE                        equ 0003h
T8CON_T8CKPS_LENGTH                      equ 0003h
T8CON_T8CKPS_MASK                        equ 0070h
T8CON_T8ON_POSN                          equ 0007h
T8CON_T8ON_POSITION                      equ 0007h
T8CON_T8ON_SIZE                          equ 0001h
T8CON_T8ON_LENGTH                        equ 0001h
T8CON_T8ON_MASK                          equ 0080h
T8CON_T8OUTPS0_POSN                      equ 0000h
T8CON_T8OUTPS0_POSITION                  equ 0000h
T8CON_T8OUTPS0_SIZE                      equ 0001h
T8CON_T8OUTPS0_LENGTH                    equ 0001h
T8CON_T8OUTPS0_MASK                      equ 0001h
T8CON_T8OUTPS1_POSN                      equ 0001h
T8CON_T8OUTPS1_POSITION                  equ 0001h
T8CON_T8OUTPS1_SIZE                      equ 0001h
T8CON_T8OUTPS1_LENGTH                    equ 0001h
T8CON_T8OUTPS1_MASK                      equ 0002h
T8CON_T8OUTPS2_POSN                      equ 0002h
T8CON_T8OUTPS2_POSITION                  equ 0002h
T8CON_T8OUTPS2_SIZE                      equ 0001h
T8CON_T8OUTPS2_LENGTH                    equ 0001h
T8CON_T8OUTPS2_MASK                      equ 0004h
T8CON_T8OUTPS3_POSN                      equ 0003h
T8CON_T8OUTPS3_POSITION                  equ 0003h
T8CON_T8OUTPS3_SIZE                      equ 0001h
T8CON_T8OUTPS3_LENGTH                    equ 0001h
T8CON_T8OUTPS3_MASK                      equ 0008h
T8CON_T8CKPS0_POSN                       equ 0004h
T8CON_T8CKPS0_POSITION                   equ 0004h
T8CON_T8CKPS0_SIZE                       equ 0001h
T8CON_T8CKPS0_LENGTH                     equ 0001h
T8CON_T8CKPS0_MASK                       equ 0010h
T8CON_T8CKPS1_POSN                       equ 0005h
T8CON_T8CKPS1_POSITION                   equ 0005h
T8CON_T8CKPS1_SIZE                       equ 0001h
T8CON_T8CKPS1_LENGTH                     equ 0001h
T8CON_T8CKPS1_MASK                       equ 0020h
T8CON_T8CKPS2_POSN                       equ 0006h
T8CON_T8CKPS2_POSITION                   equ 0006h
T8CON_T8CKPS2_SIZE                       equ 0001h
T8CON_T8CKPS2_LENGTH                     equ 0001h
T8CON_T8CKPS2_MASK                       equ 0040h
T8CON_TMR8ON_POSN                        equ 0007h
T8CON_TMR8ON_POSITION                    equ 0007h
T8CON_TMR8ON_SIZE                        equ 0001h
T8CON_TMR8ON_LENGTH                      equ 0001h
T8CON_TMR8ON_MASK                        equ 0080h

// Register: T8HLT
#define T8HLT T8HLT
T8HLT                                    equ 049Dh
// bitfield definitions
T8HLT_MODE_POSN                          equ 0000h
T8HLT_MODE_POSITION                      equ 0000h
T8HLT_MODE_SIZE                          equ 0005h
T8HLT_MODE_LENGTH                        equ 0005h
T8HLT_MODE_MASK                          equ 001Fh
T8HLT_CKSYNC_POSN                        equ 0005h
T8HLT_CKSYNC_POSITION                    equ 0005h
T8HLT_CKSYNC_SIZE                        equ 0001h
T8HLT_CKSYNC_LENGTH                      equ 0001h
T8HLT_CKSYNC_MASK                        equ 0020h
T8HLT_CKPOL_POSN                         equ 0006h
T8HLT_CKPOL_POSITION                     equ 0006h
T8HLT_CKPOL_SIZE                         equ 0001h
T8HLT_CKPOL_LENGTH                       equ 0001h
T8HLT_CKPOL_MASK                         equ 0040h
T8HLT_PSYNC_POSN                         equ 0007h
T8HLT_PSYNC_POSITION                     equ 0007h
T8HLT_PSYNC_SIZE                         equ 0001h
T8HLT_PSYNC_LENGTH                       equ 0001h
T8HLT_PSYNC_MASK                         equ 0080h
T8HLT_MODE0_POSN                         equ 0000h
T8HLT_MODE0_POSITION                     equ 0000h
T8HLT_MODE0_SIZE                         equ 0001h
T8HLT_MODE0_LENGTH                       equ 0001h
T8HLT_MODE0_MASK                         equ 0001h
T8HLT_MODE1_POSN                         equ 0001h
T8HLT_MODE1_POSITION                     equ 0001h
T8HLT_MODE1_SIZE                         equ 0001h
T8HLT_MODE1_LENGTH                       equ 0001h
T8HLT_MODE1_MASK                         equ 0002h
T8HLT_MODE2_POSN                         equ 0002h
T8HLT_MODE2_POSITION                     equ 0002h
T8HLT_MODE2_SIZE                         equ 0001h
T8HLT_MODE2_LENGTH                       equ 0001h
T8HLT_MODE2_MASK                         equ 0004h
T8HLT_MODE3_POSN                         equ 0003h
T8HLT_MODE3_POSITION                     equ 0003h
T8HLT_MODE3_SIZE                         equ 0001h
T8HLT_MODE3_LENGTH                       equ 0001h
T8HLT_MODE3_MASK                         equ 0008h
T8HLT_MODE4_POSN                         equ 0004h
T8HLT_MODE4_POSITION                     equ 0004h
T8HLT_MODE4_SIZE                         equ 0001h
T8HLT_MODE4_LENGTH                       equ 0001h
T8HLT_MODE4_MASK                         equ 0010h
T8HLT_T8MODE_POSN                        equ 0000h
T8HLT_T8MODE_POSITION                    equ 0000h
T8HLT_T8MODE_SIZE                        equ 0005h
T8HLT_T8MODE_LENGTH                      equ 0005h
T8HLT_T8MODE_MASK                        equ 001Fh
T8HLT_T8CKSYNC_POSN                      equ 0005h
T8HLT_T8CKSYNC_POSITION                  equ 0005h
T8HLT_T8CKSYNC_SIZE                      equ 0001h
T8HLT_T8CKSYNC_LENGTH                    equ 0001h
T8HLT_T8CKSYNC_MASK                      equ 0020h
T8HLT_T8CKPOL_POSN                       equ 0006h
T8HLT_T8CKPOL_POSITION                   equ 0006h
T8HLT_T8CKPOL_SIZE                       equ 0001h
T8HLT_T8CKPOL_LENGTH                     equ 0001h
T8HLT_T8CKPOL_MASK                       equ 0040h
T8HLT_T8PSYNC_POSN                       equ 0007h
T8HLT_T8PSYNC_POSITION                   equ 0007h
T8HLT_T8PSYNC_SIZE                       equ 0001h
T8HLT_T8PSYNC_LENGTH                     equ 0001h
T8HLT_T8PSYNC_MASK                       equ 0080h
T8HLT_T8MODE0_POSN                       equ 0000h
T8HLT_T8MODE0_POSITION                   equ 0000h
T8HLT_T8MODE0_SIZE                       equ 0001h
T8HLT_T8MODE0_LENGTH                     equ 0001h
T8HLT_T8MODE0_MASK                       equ 0001h
T8HLT_T8MODE1_POSN                       equ 0001h
T8HLT_T8MODE1_POSITION                   equ 0001h
T8HLT_T8MODE1_SIZE                       equ 0001h
T8HLT_T8MODE1_LENGTH                     equ 0001h
T8HLT_T8MODE1_MASK                       equ 0002h
T8HLT_T8MODE2_POSN                       equ 0002h
T8HLT_T8MODE2_POSITION                   equ 0002h
T8HLT_T8MODE2_SIZE                       equ 0001h
T8HLT_T8MODE2_LENGTH                     equ 0001h
T8HLT_T8MODE2_MASK                       equ 0004h
T8HLT_T8MODE3_POSN                       equ 0003h
T8HLT_T8MODE3_POSITION                   equ 0003h
T8HLT_T8MODE3_SIZE                       equ 0001h
T8HLT_T8MODE3_LENGTH                     equ 0001h
T8HLT_T8MODE3_MASK                       equ 0008h
T8HLT_T8MODE4_POSN                       equ 0004h
T8HLT_T8MODE4_POSITION                   equ 0004h
T8HLT_T8MODE4_SIZE                       equ 0001h
T8HLT_T8MODE4_LENGTH                     equ 0001h
T8HLT_T8MODE4_MASK                       equ 0010h

// Register: T8CLKCON
#define T8CLKCON T8CLKCON
T8CLKCON                                 equ 049Eh
// bitfield definitions
T8CLKCON_CS_POSN                         equ 0000h
T8CLKCON_CS_POSITION                     equ 0000h
T8CLKCON_CS_SIZE                         equ 0004h
T8CLKCON_CS_LENGTH                       equ 0004h
T8CLKCON_CS_MASK                         equ 000Fh
T8CLKCON_CS0_POSN                        equ 0000h
T8CLKCON_CS0_POSITION                    equ 0000h
T8CLKCON_CS0_SIZE                        equ 0001h
T8CLKCON_CS0_LENGTH                      equ 0001h
T8CLKCON_CS0_MASK                        equ 0001h
T8CLKCON_CS1_POSN                        equ 0001h
T8CLKCON_CS1_POSITION                    equ 0001h
T8CLKCON_CS1_SIZE                        equ 0001h
T8CLKCON_CS1_LENGTH                      equ 0001h
T8CLKCON_CS1_MASK                        equ 0002h
T8CLKCON_CS2_POSN                        equ 0002h
T8CLKCON_CS2_POSITION                    equ 0002h
T8CLKCON_CS2_SIZE                        equ 0001h
T8CLKCON_CS2_LENGTH                      equ 0001h
T8CLKCON_CS2_MASK                        equ 0004h
T8CLKCON_CS3_POSN                        equ 0003h
T8CLKCON_CS3_POSITION                    equ 0003h
T8CLKCON_CS3_SIZE                        equ 0001h
T8CLKCON_CS3_LENGTH                      equ 0001h
T8CLKCON_CS3_MASK                        equ 0008h
T8CLKCON_T8CS_POSN                       equ 0000h
T8CLKCON_T8CS_POSITION                   equ 0000h
T8CLKCON_T8CS_SIZE                       equ 0004h
T8CLKCON_T8CS_LENGTH                     equ 0004h
T8CLKCON_T8CS_MASK                       equ 000Fh
T8CLKCON_T8CS0_POSN                      equ 0000h
T8CLKCON_T8CS0_POSITION                  equ 0000h
T8CLKCON_T8CS0_SIZE                      equ 0001h
T8CLKCON_T8CS0_LENGTH                    equ 0001h
T8CLKCON_T8CS0_MASK                      equ 0001h
T8CLKCON_T8CS1_POSN                      equ 0001h
T8CLKCON_T8CS1_POSITION                  equ 0001h
T8CLKCON_T8CS1_SIZE                      equ 0001h
T8CLKCON_T8CS1_LENGTH                    equ 0001h
T8CLKCON_T8CS1_MASK                      equ 0002h
T8CLKCON_T8CS2_POSN                      equ 0002h
T8CLKCON_T8CS2_POSITION                  equ 0002h
T8CLKCON_T8CS2_SIZE                      equ 0001h
T8CLKCON_T8CS2_LENGTH                    equ 0001h
T8CLKCON_T8CS2_MASK                      equ 0004h
T8CLKCON_T8CS3_POSN                      equ 0003h
T8CLKCON_T8CS3_POSITION                  equ 0003h
T8CLKCON_T8CS3_SIZE                      equ 0001h
T8CLKCON_T8CS3_LENGTH                    equ 0001h
T8CLKCON_T8CS3_MASK                      equ 0008h

// Register: T8RST
#define T8RST T8RST
T8RST                                    equ 049Fh
// bitfield definitions
T8RST_RSEL_POSN                          equ 0000h
T8RST_RSEL_POSITION                      equ 0000h
T8RST_RSEL_SIZE                          equ 0005h
T8RST_RSEL_LENGTH                        equ 0005h
T8RST_RSEL_MASK                          equ 001Fh
T8RST_RSEL0_POSN                         equ 0000h
T8RST_RSEL0_POSITION                     equ 0000h
T8RST_RSEL0_SIZE                         equ 0001h
T8RST_RSEL0_LENGTH                       equ 0001h
T8RST_RSEL0_MASK                         equ 0001h
T8RST_RSEL1_POSN                         equ 0001h
T8RST_RSEL1_POSITION                     equ 0001h
T8RST_RSEL1_SIZE                         equ 0001h
T8RST_RSEL1_LENGTH                       equ 0001h
T8RST_RSEL1_MASK                         equ 0002h
T8RST_RSEL2_POSN                         equ 0002h
T8RST_RSEL2_POSITION                     equ 0002h
T8RST_RSEL2_SIZE                         equ 0001h
T8RST_RSEL2_LENGTH                       equ 0001h
T8RST_RSEL2_MASK                         equ 0004h
T8RST_RSEL3_POSN                         equ 0003h
T8RST_RSEL3_POSITION                     equ 0003h
T8RST_RSEL3_SIZE                         equ 0001h
T8RST_RSEL3_LENGTH                       equ 0001h
T8RST_RSEL3_MASK                         equ 0008h
T8RST_RSEL4_POSN                         equ 0004h
T8RST_RSEL4_POSITION                     equ 0004h
T8RST_RSEL4_SIZE                         equ 0001h
T8RST_RSEL4_LENGTH                       equ 0001h
T8RST_RSEL4_MASK                         equ 0010h
T8RST_T8RSEL_POSN                        equ 0000h
T8RST_T8RSEL_POSITION                    equ 0000h
T8RST_T8RSEL_SIZE                        equ 0005h
T8RST_T8RSEL_LENGTH                      equ 0005h
T8RST_T8RSEL_MASK                        equ 001Fh
T8RST_T8RSEL0_POSN                       equ 0000h
T8RST_T8RSEL0_POSITION                   equ 0000h
T8RST_T8RSEL0_SIZE                       equ 0001h
T8RST_T8RSEL0_LENGTH                     equ 0001h
T8RST_T8RSEL0_MASK                       equ 0001h
T8RST_T8RSEL1_POSN                       equ 0001h
T8RST_T8RSEL1_POSITION                   equ 0001h
T8RST_T8RSEL1_SIZE                       equ 0001h
T8RST_T8RSEL1_LENGTH                     equ 0001h
T8RST_T8RSEL1_MASK                       equ 0002h
T8RST_T8RSEL2_POSN                       equ 0002h
T8RST_T8RSEL2_POSITION                   equ 0002h
T8RST_T8RSEL2_SIZE                       equ 0001h
T8RST_T8RSEL2_LENGTH                     equ 0001h
T8RST_T8RSEL2_MASK                       equ 0004h
T8RST_T8RSEL3_POSN                       equ 0003h
T8RST_T8RSEL3_POSITION                   equ 0003h
T8RST_T8RSEL3_SIZE                       equ 0001h
T8RST_T8RSEL3_LENGTH                     equ 0001h
T8RST_T8RSEL3_MASK                       equ 0008h
T8RST_T8RSEL4_POSN                       equ 0004h
T8RST_T8RSEL4_POSITION                   equ 0004h
T8RST_T8RSEL4_SIZE                       equ 0001h
T8RST_T8RSEL4_LENGTH                     equ 0001h
T8RST_T8RSEL4_MASK                       equ 0010h

// Register: OPA1NCHS
#define OPA1NCHS OPA1NCHS
OPA1NCHS                                 equ 050Fh
// bitfield definitions
OPA1NCHS_NCH_POSN                        equ 0000h
OPA1NCHS_NCH_POSITION                    equ 0000h
OPA1NCHS_NCH_SIZE                        equ 0008h
OPA1NCHS_NCH_LENGTH                      equ 0008h
OPA1NCHS_NCH_MASK                        equ 00FFh
OPA1NCHS_OPA1NCH_POSN                    equ 0000h
OPA1NCHS_OPA1NCH_POSITION                equ 0000h
OPA1NCHS_OPA1NCH_SIZE                    equ 0008h
OPA1NCHS_OPA1NCH_LENGTH                  equ 0008h
OPA1NCHS_OPA1NCH_MASK                    equ 00FFh

// Register: OPA1PCHS
#define OPA1PCHS OPA1PCHS
OPA1PCHS                                 equ 0510h
// bitfield definitions
OPA1PCHS_PCH_POSN                        equ 0000h
OPA1PCHS_PCH_POSITION                    equ 0000h
OPA1PCHS_PCH_SIZE                        equ 0008h
OPA1PCHS_PCH_LENGTH                      equ 0008h
OPA1PCHS_PCH_MASK                        equ 00FFh
OPA1PCHS_OPA1PCH_POSN                    equ 0000h
OPA1PCHS_OPA1PCH_POSITION                equ 0000h
OPA1PCHS_OPA1PCH_SIZE                    equ 0008h
OPA1PCHS_OPA1PCH_LENGTH                  equ 0008h
OPA1PCHS_OPA1PCH_MASK                    equ 00FFh

