GopalSaraf/Practicals/PSDL/include/proc/pic16f1778.inc
// Register: DAC7REF
#define DAC7REF DAC7REF
DAC7REF                                  equ 059Fh
// bitfield definitions
DAC7REF_DACR_POSN                        equ 0000h
DAC7REF_DACR_POSITION                    equ 0000h
DAC7REF_DACR_SIZE                        equ 0005h
DAC7REF_DACR_LENGTH                      equ 0005h
DAC7REF_DACR_MASK                        equ 001Fh
DAC7REF_DACR0_POSN                       equ 0000h
DAC7REF_DACR0_POSITION                   equ 0000h
DAC7REF_DACR0_SIZE                       equ 0001h
DAC7REF_DACR0_LENGTH                     equ 0001h
DAC7REF_DACR0_MASK                       equ 0001h
DAC7REF_DACR1_POSN                       equ 0001h
DAC7REF_DACR1_POSITION                   equ 0001h
DAC7REF_DACR1_SIZE                       equ 0001h
DAC7REF_DACR1_LENGTH                     equ 0001h
DAC7REF_DACR1_MASK                       equ 0002h
DAC7REF_DACR2_POSN                       equ 0002h
DAC7REF_DACR2_POSITION                   equ 0002h
DAC7REF_DACR2_SIZE                       equ 0001h
DAC7REF_DACR2_LENGTH                     equ 0001h
DAC7REF_DACR2_MASK                       equ 0004h
DAC7REF_DACR3_POSN                       equ 0003h
DAC7REF_DACR3_POSITION                   equ 0003h
DAC7REF_DACR3_SIZE                       equ 0001h
DAC7REF_DACR3_LENGTH                     equ 0001h
DAC7REF_DACR3_MASK                       equ 0008h
DAC7REF_DACR4_POSN                       equ 0004h
DAC7REF_DACR4_POSITION                   equ 0004h
DAC7REF_DACR4_SIZE                       equ 0001h
DAC7REF_DACR4_LENGTH                     equ 0001h
DAC7REF_DACR4_MASK                       equ 0010h
DAC7REF_R0_POSN                          equ 0000h
DAC7REF_R0_POSITION                      equ 0000h
DAC7REF_R0_SIZE                          equ 0001h
DAC7REF_R0_LENGTH                        equ 0001h
DAC7REF_R0_MASK                          equ 0001h
DAC7REF_R1_POSN                          equ 0001h
DAC7REF_R1_POSITION                      equ 0001h
DAC7REF_R1_SIZE                          equ 0001h
DAC7REF_R1_LENGTH                        equ 0001h
DAC7REF_R1_MASK                          equ 0002h
DAC7REF_R2_POSN                          equ 0002h
DAC7REF_R2_POSITION                      equ 0002h
DAC7REF_R2_SIZE                          equ 0001h
DAC7REF_R2_LENGTH                        equ 0001h
DAC7REF_R2_MASK                          equ 0004h
DAC7REF_R3_POSN                          equ 0003h
DAC7REF_R3_POSITION                      equ 0003h
DAC7REF_R3_SIZE                          equ 0001h
DAC7REF_R3_LENGTH                        equ 0001h
DAC7REF_R3_MASK                          equ 0008h
DAC7REF_R4_POSN                          equ 0004h
DAC7REF_R4_POSITION                      equ 0004h
DAC7REF_R4_SIZE                          equ 0001h
DAC7REF_R4_LENGTH                        equ 0001h
DAC7REF_R4_MASK                          equ 0010h
DAC7REF_DAC7R_POSN                       equ 0000h
DAC7REF_DAC7R_POSITION                   equ 0000h
DAC7REF_DAC7R_SIZE                       equ 0005h
DAC7REF_DAC7R_LENGTH                     equ 0005h
DAC7REF_DAC7R_MASK                       equ 001Fh
DAC7REF_DAC7R0_POSN                      equ 0000h
DAC7REF_DAC7R0_POSITION                  equ 0000h
DAC7REF_DAC7R0_SIZE                      equ 0001h
DAC7REF_DAC7R0_LENGTH                    equ 0001h
DAC7REF_DAC7R0_MASK                      equ 0001h
DAC7REF_DAC7R1_POSN                      equ 0001h
DAC7REF_DAC7R1_POSITION                  equ 0001h
DAC7REF_DAC7R1_SIZE                      equ 0001h
DAC7REF_DAC7R1_LENGTH                    equ 0001h
DAC7REF_DAC7R1_MASK                      equ 0002h
DAC7REF_DAC7R2_POSN                      equ 0002h
DAC7REF_DAC7R2_POSITION                  equ 0002h
DAC7REF_DAC7R2_SIZE                      equ 0001h
DAC7REF_DAC7R2_LENGTH                    equ 0001h
DAC7REF_DAC7R2_MASK                      equ 0004h
DAC7REF_DAC7R3_POSN                      equ 0003h
DAC7REF_DAC7R3_POSITION                  equ 0003h
DAC7REF_DAC7R3_SIZE                      equ 0001h
DAC7REF_DAC7R3_LENGTH                    equ 0001h
DAC7REF_DAC7R3_MASK                      equ 0008h
DAC7REF_DAC7R4_POSN                      equ 0004h
DAC7REF_DAC7R4_POSITION                  equ 0004h
DAC7REF_DAC7R4_SIZE                      equ 0001h
DAC7REF_DAC7R4_LENGTH                    equ 0001h
DAC7REF_DAC7R4_MASK                      equ 0010h
DAC7REF_REF0_POSN                        equ 0000h
DAC7REF_REF0_POSITION                    equ 0000h
DAC7REF_REF0_SIZE                        equ 0001h
DAC7REF_REF0_LENGTH                      equ 0001h
DAC7REF_REF0_MASK                        equ 0001h
DAC7REF_REF1_POSN                        equ 0001h
DAC7REF_REF1_POSITION                    equ 0001h
DAC7REF_REF1_SIZE                        equ 0001h
DAC7REF_REF1_LENGTH                      equ 0001h
DAC7REF_REF1_MASK                        equ 0002h
DAC7REF_REF2_POSN                        equ 0002h
DAC7REF_REF2_POSITION                    equ 0002h
DAC7REF_REF2_SIZE                        equ 0001h
DAC7REF_REF2_LENGTH                      equ 0001h
DAC7REF_REF2_MASK                        equ 0004h
DAC7REF_REF3_POSN                        equ 0003h
DAC7REF_REF3_POSITION                    equ 0003h
DAC7REF_REF3_SIZE                        equ 0001h
DAC7REF_REF3_LENGTH                      equ 0001h
DAC7REF_REF3_MASK                        equ 0008h
DAC7REF_REF4_POSN                        equ 0004h
DAC7REF_REF4_POSITION                    equ 0004h
DAC7REF_REF4_SIZE                        equ 0001h
DAC7REF_REF4_LENGTH                      equ 0001h
DAC7REF_REF4_MASK                        equ 0010h
DAC7REF_DAC7REF0_POSN                    equ 0000h
DAC7REF_DAC7REF0_POSITION                equ 0000h
DAC7REF_DAC7REF0_SIZE                    equ 0001h
DAC7REF_DAC7REF0_LENGTH                  equ 0001h
DAC7REF_DAC7REF0_MASK                    equ 0001h
DAC7REF_DAC7REF1_POSN                    equ 0001h
DAC7REF_DAC7REF1_POSITION                equ 0001h
DAC7REF_DAC7REF1_SIZE                    equ 0001h
DAC7REF_DAC7REF1_LENGTH                  equ 0001h
DAC7REF_DAC7REF1_MASK                    equ 0002h
DAC7REF_DAC7REF2_POSN                    equ 0002h
DAC7REF_DAC7REF2_POSITION                equ 0002h
DAC7REF_DAC7REF2_SIZE                    equ 0001h
DAC7REF_DAC7REF2_LENGTH                  equ 0001h
DAC7REF_DAC7REF2_MASK                    equ 0004h
DAC7REF_DAC7REF3_POSN                    equ 0003h
DAC7REF_DAC7REF3_POSITION                equ 0003h
DAC7REF_DAC7REF3_SIZE                    equ 0001h
DAC7REF_DAC7REF3_LENGTH                  equ 0001h
DAC7REF_DAC7REF3_MASK                    equ 0008h
DAC7REF_DAC7REF4_POSN                    equ 0004h
DAC7REF_DAC7REF4_POSITION                equ 0004h
DAC7REF_DAC7REF4_SIZE                    equ 0001h
DAC7REF_DAC7REF4_LENGTH                  equ 0001h
DAC7REF_DAC7REF4_MASK                    equ 0010h

