GopalSaraf/Practicals/PSDL/include/proc/pic16f1778.inc
// Register: PWM11OFCON
#define PWM11OFCON PWM11OFCON
PWM11OFCON                               equ 0DC0h
// bitfield definitions
PWM11OFCON_OFS_POSN                      equ 0000h
PWM11OFCON_OFS_POSITION                  equ 0000h
PWM11OFCON_OFS_SIZE                      equ 0002h
PWM11OFCON_OFS_LENGTH                    equ 0002h
PWM11OFCON_OFS_MASK                      equ 0003h
PWM11OFCON_OFO_POSN                      equ 0004h
PWM11OFCON_OFO_POSITION                  equ 0004h
PWM11OFCON_OFO_SIZE                      equ 0001h
PWM11OFCON_OFO_LENGTH                    equ 0001h
PWM11OFCON_OFO_MASK                      equ 0010h
PWM11OFCON_OFM_POSN                      equ 0005h
PWM11OFCON_OFM_POSITION                  equ 0005h
PWM11OFCON_OFM_SIZE                      equ 0002h
PWM11OFCON_OFM_LENGTH                    equ 0002h
PWM11OFCON_OFM_MASK                      equ 0060h
PWM11OFCON_PWM11OFS0_POSN                equ 0000h
PWM11OFCON_PWM11OFS0_POSITION            equ 0000h
PWM11OFCON_PWM11OFS0_SIZE                equ 0001h
PWM11OFCON_PWM11OFS0_LENGTH              equ 0001h
PWM11OFCON_PWM11OFS0_MASK                equ 0001h
PWM11OFCON_PWM11OFS1_POSN                equ 0001h
PWM11OFCON_PWM11OFS1_POSITION            equ 0001h
PWM11OFCON_PWM11OFS1_SIZE                equ 0001h
PWM11OFCON_PWM11OFS1_LENGTH              equ 0001h
PWM11OFCON_PWM11OFS1_MASK                equ 0002h
PWM11OFCON_PWM11OFM0_POSN                equ 0005h
PWM11OFCON_PWM11OFM0_POSITION            equ 0005h
PWM11OFCON_PWM11OFM0_SIZE                equ 0001h
PWM11OFCON_PWM11OFM0_LENGTH              equ 0001h
PWM11OFCON_PWM11OFM0_MASK                equ 0020h
PWM11OFCON_PWM11OFM1_POSN                equ 0006h
PWM11OFCON_PWM11OFM1_POSITION            equ 0006h
PWM11OFCON_PWM11OFM1_SIZE                equ 0001h
PWM11OFCON_PWM11OFM1_LENGTH              equ 0001h
PWM11OFCON_PWM11OFM1_MASK                equ 0040h
PWM11OFCON_PWM11OFS_POSN                 equ 0000h
PWM11OFCON_PWM11OFS_POSITION             equ 0000h
PWM11OFCON_PWM11OFS_SIZE                 equ 0002h
PWM11OFCON_PWM11OFS_LENGTH               equ 0002h
PWM11OFCON_PWM11OFS_MASK                 equ 0003h
PWM11OFCON_PWM11OFMC_POSN                equ 0004h
PWM11OFCON_PWM11OFMC_POSITION            equ 0004h
PWM11OFCON_PWM11OFMC_SIZE                equ 0001h
PWM11OFCON_PWM11OFMC_LENGTH              equ 0001h
PWM11OFCON_PWM11OFMC_MASK                equ 0010h
PWM11OFCON_PWM11OFM_POSN                 equ 0005h
PWM11OFCON_PWM11OFM_POSITION             equ 0005h
PWM11OFCON_PWM11OFM_SIZE                 equ 0002h
PWM11OFCON_PWM11OFM_LENGTH               equ 0002h
PWM11OFCON_PWM11OFM_MASK                 equ 0060h
PWM11OFCON_OFS0_POSN                     equ 0000h
PWM11OFCON_OFS0_POSITION                 equ 0000h
PWM11OFCON_OFS0_SIZE                     equ 0001h
PWM11OFCON_OFS0_LENGTH                   equ 0001h
PWM11OFCON_OFS0_MASK                     equ 0001h
PWM11OFCON_OFS1_POSN                     equ 0001h
PWM11OFCON_OFS1_POSITION                 equ 0001h
PWM11OFCON_OFS1_SIZE                     equ 0001h
PWM11OFCON_OFS1_LENGTH                   equ 0001h
PWM11OFCON_OFS1_MASK                     equ 0002h
PWM11OFCON_OFM0_POSN                     equ 0005h
PWM11OFCON_OFM0_POSITION                 equ 0005h
PWM11OFCON_OFM0_SIZE                     equ 0001h
PWM11OFCON_OFM0_LENGTH                   equ 0001h
PWM11OFCON_OFM0_MASK                     equ 0020h
PWM11OFCON_OFM1_POSN                     equ 0006h
PWM11OFCON_OFM1_POSITION                 equ 0006h
PWM11OFCON_OFM1_SIZE                     equ 0001h
PWM11OFCON_OFM1_LENGTH                   equ 0001h
PWM11OFCON_OFM1_MASK                     equ 0040h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Ch
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E0Dh
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0006h
INTPPS_INTPPS_LENGTH                     equ 0006h
INTPPS_INTPPS_MASK                       equ 003Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E0Eh
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0006h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0006h
T0CKIPPS_T0CKIPPS_MASK                   equ 003Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E0Fh
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0006h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0006h
T1CKIPPS_T1CKIPPS_MASK                   equ 003Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E10h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0006h
T1GPPS_T1GPPS_LENGTH                     equ 0006h
T1GPPS_T1GPPS_MASK                       equ 003Fh

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0E11h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0006h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0006h
T3CKIPPS_T3CKIPPS_MASK                   equ 003Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0E12h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0006h
T3GPPS_T3GPPS_LENGTH                     equ 0006h
T3GPPS_T3GPPS_MASK                       equ 003Fh

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 0E13h
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0006h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0006h
T5CKIPPS_T5CKIPPS_MASK                   equ 003Fh

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 0E14h
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0006h
T5GPPS_T5GPPS_LENGTH                     equ 0006h
T5GPPS_T5GPPS_MASK                       equ 003Fh

